In [63]:
import sys
import os
from datetime import datetime, timedelta

import pandas as pd
import numpy as np

import re
import matplotlib.pyplot as plt

pd.options.display.max_rows=500
pd.options.display.max_columns=500

In [64]:
from random import *
import win32api, win32con,time,tkinter

def click(x,y):
    # cursor move
    win32api.SetCursorPos((x,y))
    # click even call
    win32api.mouse_event(win32con.MOUSEEVENTF_LEFTDOWN,x,y,0,0)
    win32api.mouse_event(win32con.MOUSEEVENTF_LEFTUP,x,y,0,0)

In [65]:
i= 0
while i < 65:
    #get screen size
    root = tkinter.Tk()
    screen_width = root.winfo_screenwidth()
    screen_height = root.winfo_screenheight()
    #pass random value to axis
    x = randint(screen_height,screen_width)
    y = randint(screen_height,screen_width)
    click(x,y)
    #print('i am moving to x=',x,' and y=',y)
    time.sleep(180)#call each 5 seconds
    i = i +1
    print(i)

1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65

In [7]:
import os, sys

In [6]:
os.sep

'\\'

In [8]:
sp    = []
sp[:] = sys.path
sp[0] = os.path.abspath(sp[0])

In [10]:
sp.insert(1, os.path.expanduser('~/.config/saspy'))
sp.insert(0, __file__.rsplit(os.sep+'__init__.py')[0])

NameError: name '__file__' is not defined

In [15]:
dict={'A':30, 'B':40, 'C':50}
index=['A', 'B', 'C']
pd.Series(data=dict, index=index)

A    30
B    40
C    50
dtype: int64

In [16]:
a1 = ['Hogwarts', 'Durmstrang', 'Beauxbatons']
a2 = ['Hogwarts', 'Durmstrang', 'Beauxbatons']
a3 = ['Hogwarts', 'Durmstrang', 'Beauxbatons']
school = [a1, a2, a3]

In [17]:
school

[['Hogwarts', 'Durmstrang', 'Beauxbatons'],
 ['Hogwarts', 'Durmstrang', 'Beauxbatons'],
 ['Hogwarts', 'Durmstrang', 'Beauxbatons']]

In [18]:
inst = ['School_1', 'School_2', 'School_3']
Muggle_data = pd.DataFrame(data=school, columns=inst)

In [19]:
Muggle_data

   School_1    School_2     School_3
0  Hogwarts  Durmstrang  Beauxbatons
1  Hogwarts  Durmstrang  Beauxbatons
2  Hogwarts  Durmstrang  Beauxbatons

In [30]:
a = np.arange(0,40, 1).reshape(5,8)
df = pd.DataFrame(data=a)
df.head()

    0   1   2   3   4   5   6   7
0   0   1   2   3   4   5   6   7
1   8   9  10  11  12  13  14  15
2  16  17  18  19  20  21  22  23
3  24  25  26  27  28  29  30  31
4  32  33  34  35  36  37  38  39

In [34]:
df.index[::-1]

RangeIndex(start=4, stop=-1, step=-1)

In [36]:
ser1 = pd.Series(list('abcd'))
ser2 = pd.Series(np.arange(4))

df = pd.concat([ser1, ser2], axis=1)
df

   0  1
0  a  0
1  b  1
2  c  2
3  d  3

In [46]:
df = pd.concat([ser1, ser2], axis=0)
df

0    a
1    b
2    c
3    d
0    0
1    1
2    2
3    3
dtype: object

In [41]:
df = pd.DataFrame({'col1': ser1, 'col2': ser2})
df

  col1  col2
0    a     0
1    b     1
2    c     2
3    d     3

In [53]:
data1={'Physics': [77, 75, 100, 10, 59], 'Chemistry': [85, 70, 99, 30, 80]}
df1=pd.DataFrame(data=data1)
data2={'Student_ID': [0, 1, 2, 3, 4], 'Maths': [80, 90, 88, 25, 90]}
df2=pd.DataFrame(data=data2)
df3=pd.concat([df1, df2], join='inner', axis=1, ignore_index=True)
df3

     0   1  2   3
0   77  85  0  80
1   75  70  1  90
2  100  99  2  88
3   10  30  3  25
4   59  80  4  90

In [54]:
df_employee = [('John', 3400, 'Sydeny'),
 ('Robert', 3000, 'Chicago'),
 ('Aadi', 1600, 'New York'),
 ('Robert', 3000, 'Chicago'),
 ('Robert', 3000, 'Chicago'),
 ('Robert', 3000, 'Texas'),
 ('Aadi', 4000, 'London'),
 ('Sachin', 3000, 'Chicago')]
df_employee = pd.DataFrame(df_employee, columns=['Name', 'Salary', 'City'])
df_employee[df_employee.duplicated('Name')].shape

(4, 3)

In [60]:
data = {'Student1': {'name': 'Emma', 'age': '27', 'sex': 'Female'},
'Student2': {'name': 'Mike', 'age': '22', 'sex': 'Male'}}
df_students = pd.DataFrame(data=data)

In [61]:
df_students

     Student1 Student2
name     Emma     Mike
age        27       22
sex    Female     Male

In [62]:

df_students.replace(['Mike', 'John'], inplace=True)

Student1    None
Student2    None
dtype: object

In [63]:
df_students

     Student1 Student2
name     Emma     Mike
age        27       22
sex    Female     Male

In [64]:
df_students.replace('Mike', 'John', inplace=True)

In [65]:
df_students

     Student1 Student2
name     Emma     John
age        27       22
sex    Female     Male

In [2]:
from scipy.stats import norm

mu = 1007.46
sigma = 204.43

In [15]:
prob = norm.cdf(67000, 55000, 6200)
prob

0.973534526985065

In [16]:
0.97 - 0.74

0.22999999999999998

In [9]:
a = (56.88 - 47.5) / 12.3
a

0.7626016260162604

In [11]:
b = (77.1 - 77) / 8.2
b

0.01219512195121882

In [13]:
c = (35.55 - 33) / 7.3
c

0.3493150684931503

In [8]:
from scipy.stats import norm
# t t-distribution when we dont have the standard deviation of the population just the sample

#Cuidado com as unidades na population variance if squared needed to sqrt
x_bar, sigma = 180, np.sqrt(36)

n = 100

np.round(norm.interval(0.95, loc=x_bar, scale=sigma / np.sqrt(n)), 2)

array([178.82, 181.18])

In [41]:
names = ['Alice', 'Bob', 'Charlie', 'john', 'anna', 'aline']
ages = (24, 50, 18, 25, 59, 12)

z = zip(names, ages)
print(z)
print(type(z))

<zip object at 0x00000210351CBC08>
<class 'zip'>

In [44]:
lst = [list(a) for a in zip(names, ages)]
sorted_arr = sorted(lst,key=lambda x: x[1],reverse=True)
print(sorted_arr[:2])

[['anna', 59], ['Bob', 50]]

In [45]:
sorted_arr

[['anna', 59],
 ['Bob', 50],
 ['john', 25],
 ['Alice', 24],
 ['Charlie', 18],
 ['aline', 12]]

In [40]:
sorted_arr = sorted(lst,key=lambda x: x[1],reverse=True)
print(sorted_arr[:2])
print(output)

[['Bob', 50], ['Alice', 24]]
[['Alice', 24], ['Bob', 50], ['Charlie', 18]]